<template>
    <main class="grid-container overflow-hidden">
        <div class="flex max-lg:flex-col gap-[30px] justify-between mt-[30px] lg:mt-[70px]">
            <div class="flex flex-col justify-between flex-1">
                <h1 class="text-[1.75rem] lg:text-4xl leading-[1.2] font-bold text-fblack mb-[30px]">О нас</h1>
                <img src="@/assets/imgs/img5.png" class="lg:max-w-[387px] object-cover max-h-[378px] w-full rounded-[5px]" alt="">
            </div>
            <div class="flex-[1.45] space-y-5">
                <p class="lg:text-xl font-medium lg:leading-[1.4] leading-[1.4] text-fblack">Экскурсионный центр города Казани открылся в 2010 году и был первым, кто стал проводить сборные ежедневные экскурсии по Казани и Татарстану.</p>
                <p class="text-sm  leading-[1.4] text-ftext3">
                    На нашем счету несколько высших наград Всероссийской туристской премии «Маршрут года» и Республиканского конкурса «Лидер туризма». Среди них – Гран-при в конкурсе «Маршруте года-2016» за интерактивную экскурсию «Казань пятью органами чувств» и 1 место в конкурсе «Маршруте года-2017» за гастрономическую экскурсию «Казан вкусов».
                    <br><br>
                    Наш Экскурсионный центр обеспечивал экскурсионное обслуживание участников и гостей XXVII Всемирной летней универсиады студентов 2013 в Казани, XVI Чемпионата мира ФИНА по водным видам спорта 2015 в Казани, Чемпионата мира по футболу 2018 года.
                    <br><br>
                    В период Чемпионата мира по футболу в расписании появились сборные экскурсии на разных иностранных языках, болельщикам предлагались уникальные программы с экстремальными активностями (дайвинг, прыжки с парашютом, посещением трассы). Для тех, кому наскучили стандартные экскурсии, разработаны гастрономические и интерактивные программы, специально для казанцев запущен цикл авторских экскурсий «Казанские истории».
                    <br><br>
                    Мы надеемся, что впереди у нас еще много открытий и достижений,
                    которые мы совершим вместе с вами!
                    <br><br>
                    До встречи в Казани! Ваш Экскурсионный центр г. Казани
                </p>
            </div>
        </div>
        <div class="pt-20 lg:pt-[150px]">
            <h2 class="text-2xl lg:text-3xl font-bold leading-1.2 text-fblack mb-[30px]"><span class="text-fred">Наша</span> команда</h2>
            <Team/>
        </div>
    </main>
</template>

<script setup>

</script>
